#+TITLE: AWS GenAI RAG Workshop: Outcomes & Strategic Value
#+SUBTITLE: Engineering Management Briefing - June 5, 2025
#+AUTHOR: Engineering Team
#+DATE: June 5, 2025
#+OPTIONS: toc:nil num:nil ^:nil
#+LATEX_CLASS: beamer
#+LATEX_CLASS_OPTIONS: [presentation]
#+BEAMER_THEME: metropolis
#+BEAMER_COLOR_THEME: crane
#+EXPORT_FILE_NAME: presentation

** Workshop Investment vs. Returns

#+BEGIN_SRC python :exports results :results output raw
investment = 8 * 150 * 10  # 8 hours * $150/hour * 10 developers
monthly_savings = 5000  # Conservative estimate
roi_months = investment / monthly_savings
print(f"| Metric | Value |")
print(f"|--------|-------|")
print(f"| Workshop Investment | ${investment:,} |")
print(f"| Monthly Savings Potential | ${monthly_savings:,} |")
print(f"| Payback Period | {roi_months:.1f} months |")
print(f"| First Year ROI | {((monthly_savings * 12 - investment) / investment * 100):.0f}% |")
#+END_SRC

#+RESULTS:
| Metric | Value |
|--------|-------|
| Workshop Investment | $12,000 |
| Monthly Savings Potential | $5,000 |
| Payback Period | 2.4 months |
| First Year ROI | 400% |

